In [4]:
import pandas as pd

In [7]:
#시리즈 만들기(문자열)
menu = pd.Series(['육회비빔밥','타코야끼','불닭볶음면'])
menu

0    육회비빔밥
1     타코야끼
2    불닭볶음면
dtype: object

In [8]:
#시리즈 만들기(정수)
price = pd.Series([10000,9000,3000])
price

0    10000
1     9000
2     3000
dtype: int64

In [9]:
#데이터 프레임 만들기 pd.DataFrame({"컬럼명":데이터})
pd.DataFrame({
    "메뉴":menu,
    "가격":price
})

      메뉴     가격
0  육회비빔밥  10000
1   타코야끼   9000
2  불닭볶음면   3000

In [11]:
#데이터 프레임 만들기 pd.DataFrame({"컬럼명":데이터})
df = pd.DataFrame({
    "메뉴":['육회비빔밥','타코야끼','불닭볶음면'],
    "가격":['10000','9000','3000'],
    "원산지":['국내산','국내산','국내산']
})
df

      메뉴     가격  원산지
0  육회비빔밥  10000  국내산
1   타코야끼   9000  국내산
2  불닭볶음면   3000  국내산

In [15]:
#시리즈 선택(메뉴)
df['메뉴']

0    육회비빔밥
1     타코야끼
2    불닭볶음면
Name: 메뉴, dtype: object

In [16]:
#데이터 프레임 선택(메뉴,가격)
df[['메뉴','가격']]

      메뉴     가격
0  육회비빔밥  10000
1   타코야끼   9000
2  불닭볶음면   3000

In [17]:
#데이터 프레임 선택(메뉴,가격)
cols = ['메뉴','가격']
df[cols]

      메뉴     가격
0  육회비빔밥  10000
1   타코야끼   9000
2  불닭볶음면   3000

In [21]:
#데이터 프레임 type 확인
print("df           : ",type(df))
print("df['가격']   : ",type(df['가격']))
print("df[['가격']] : ",type(df[['가격']]))

df           :  <class 'pandas.core.frame.DataFrame'>
df['가격']   :  <class 'pandas.core.series.Series'>
df[['가격']] :  <class 'pandas.core.frame.DataFrame'>

In [22]:
df = pd.DataFrame({
    "메뉴":['아메리카노','카페라뗴','카페모카','에스프레소','밀크티'],
    "가격":[4000,5000,5000,3000,5500],
    "칼로리":[20,110,250,20,300],
})
df

      메뉴    가격  칼로리
0  아메리카노  4000   20
1   카페라뗴  5000  110
2   카페모카  5000  250
3  에스프레소  3000   20
4    밀크티  5500  300

In [23]:
df.to_csv('temp.csv')

In [24]:
temp_df = pd.read_csv('temp.csv')
temp_df.head()
#갑자기 unnamed가 생긴 것을 볼 수 있음

   Unnamed: 0     메뉴    가격  칼로리
0           0  아메리카노  4000   20
1           1   카페라뗴  5000  110
2           2   카페모카  5000  250
3           3  에스프레소  3000   20
4           4    밀크티  5500  300

In [25]:
df.to_csv('cafe.csv',index=False) #index 저장하지 않겠다
df = pd.read_csv('cafe.csv')
df.head()

      메뉴    가격  칼로리
0  아메리카노  4000   20
1   카페라뗴  5000  110
2   카페모카  5000  250
3  에스프레소  3000   20
4    밀크티  5500  300

In [26]:
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4000   20
1   카페라뗴  5000  110

In [27]:
df.tail(3)

      메뉴    가격  칼로리
2   카페모카  5000  250
3  에스프레소  3000   20
4    밀크티  5500  300

In [28]:
df.sample(3) #랜덤으로 보여짐

      메뉴    가격  칼로리
4    밀크티  5500  300
0  아메리카노  4000   20
2   카페모카  5000  250

In [29]:
#데이터프레임 크기(행, 컬럼)
df.shape

(5, 3)

In [30]:
#컬럼 형태(type)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      5 non-null      object
 1   가격      5 non-null      int64
 2   칼로리     5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [31]:
#상관관계
df.corr(numeric_only=True) #데이터프레임에 object컬럼이 있기 때문에

           가격       칼로리
가격   1.000000  0.847408
칼로리  0.847408  1.000000

In [32]:
df_car = pd.DataFrame({
    "car":['Sedan','SUV','Sedan','SUV','SUV','SUV','Sedan','SUV','Sedan','Sedan'],
    "size":['S','M','S','S','M','M','L','S','S','M']
})
df_car.head(3)

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S

In [33]:
#항목 종류 
df_car.nunique() #숫자

car     2
size    3
dtype: int64

In [34]:
#항목 종류
print(df_car['car'].unique())
print(df_car['size'].unique())

['Sedan' 'SUV']
['S' 'M' 'L']

In [35]:
#항목별 개수
print(df_car['car'].value_counts())
print(df_car['size'].value_counts())

car
Sedan    5
SUV      5
Name: count, dtype: int64
size
S    5
M    4
L    1
Name: count, dtype: int64

In [36]:
df.describe()

           가격        칼로리
count     5.0    5.00000
mean   4500.0  140.00000
std    1000.0  129.80755
min    3000.0   20.00000
25%    4000.0   20.00000
50%    5000.0  110.00000
75%    5000.0  250.00000
max    5500.0  300.00000

In [37]:
df_car.describe(include="O")

          car size
count      10   10
unique      2    3
top     Sedan    S
freq        5    5

In [38]:
df.describe(include="O")

           메뉴
count       5
unique      5
top     아메리카노
freq        1

In [40]:
data = {
    "메뉴":['아메리카노','카페라뗴','카페모카','에스프레소','밀크티'],
    "가격":[4000.0,5000.0,5000.0,3000.0,5500.0],
    "칼로리":['20','110','250','20','300'],
}
df=pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      5 non-null      object
 1   가격      5 non-null      float64
 2   칼로리     5 non-null      object
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [41]:
#자료형 변환 / astype / float->int
df['가격'] = df['가격'].astype('int')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      5 non-null      object
 1   가격      5 non-null      int64
 2   칼로리     5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [42]:
#자료형 변환 / astype / object->float
df['칼로리'] = df['칼로리'].astype('float')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      5 non-null      object
 1   가격      5 non-null      int64
 2   칼로리     5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 252.0+ bytes

In [44]:
df = pd.read_csv('cafe.csv')
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4000   20
1   카페라뗴  5000  110

In [45]:
#새로운 컬럼 추가 (값은 0)
df['new'] = 0
df.head(2)

      메뉴    가격  칼로리  new
0  아메리카노  4000   20    0
1   카페라뗴  5000  110    0

In [46]:
#할인가 컬럼 추가
discount=0.2
df['할인가']=df['가격'] * (1-discount)
df.head(2)

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4000   20    0  3200.0
1   카페라뗴  5000  110    0  4000.0

In [48]:
#행 삭제
df = df.drop(1,axis=0)
df.head(3)

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4000   20    0  3200.0
2   카페모카  5000  250    0  4000.0
3  에스프레소  3000   20    0  2400.0

In [50]:
#컬럼 삭제
#axis=0:행방향, axis=1:열방향(컬럼)
df = df.drop('칼로리',axis=1)
df.head(3)

      메뉴    가격  new     할인가
0  아메리카노  4000    0  3200.0
2   카페모카  5000    0  4000.0
3  에스프레소  3000    0  2400.0

In [51]:
df = pd.read_csv('cafe.csv')
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4000   20
1   카페라뗴  5000  110

In [52]:
#인덱싱 (행 전체)
#아메리카노
df.loc[0]

메뉴     아메리카노
가격      4000
칼로리       20
Name: 0, dtype: object

In [54]:
#카페라뗴 가격
df.loc[1,"가격"]
print(df.loc[1,"가격"])

5000

In [55]:
#슬라이싱 (컬럼 전체)
#가격
df.loc[:,"가격"]

0    4000
1    5000
2    5000
3    3000
4    5500
Name: 가격, dtype: int64

In [56]:
#슬라이싱
df.loc[2,'메뉴':'칼로리']

메뉴     카페모카
가격     5000
칼로리     250
Name: 2, dtype: object

In [57]:
#슬라이싱
#카페모카 메뉴와 칼로리
df.loc[2,['메뉴','칼로리']]

메뉴     카페모카
칼로리     250
Name: 2, dtype: object

In [59]:
#슬라이싱
df.loc[1:3,['메뉴','가격']]

      메뉴    가격
1   카페라뗴  5000
2   카페모카  5000
3  에스프레소  3000

In [60]:
df = pd.read_csv('cafe.csv')
df = df.drop(0,axis=0)#첫번째행 삭제
df.head(2)

     메뉴    가격  칼로리
1  카페라뗴  5000  110
2  카페모카  5000  250

In [61]:
#인덱싱(행 전체)
#카페라뗴
df.iloc[0]

메뉴     카페라뗴
가격     5000
칼로리     110
Name: 1, dtype: object

In [62]:
#슬라이싱(컬럼 전체)
#가격
df.iloc[:,1]

1    5000
2    5000
3    3000
4    5500
Name: 가격, dtype: int64

In [63]:
df

      메뉴    가격  칼로리
1   카페라뗴  5000  110
2   카페모카  5000  250
3  에스프레소  3000   20
4    밀크티  5500  300

In [64]:
#슬라이싱
#에스프레소 메뉴와 가격
df.iloc[2,0:2]

메뉴    에스프레소
가격     3000
Name: 3, dtype: object

In [65]:
#슬라이싱(카페모카와 에스프레소의 전체 데이터)
df.iloc[1:3]

      메뉴    가격  칼로리
2   카페모카  5000  250
3  에스프레소  3000   20

In [66]:
#loc 슬라이싱(카페모카와 에스프레소의 전체 데이터)
df.loc[2:3,'메뉴':'칼로리']

      메뉴    가격  칼로리
2   카페모카  5000  250
3  에스프레소  3000   20

In [71]:
import numpy as np
df['원산지']=np.nan
df.head(4)

      메뉴    가격  칼로리  원산지
4    밀크티  5500  300  NaN
1   카페라뗴  5000  110  NaN
2   카페모카  5000  250  NaN
0  아메리카노  4000   20  NaN

In [73]:
df.loc[0,"원산지"]='콜롬비아'
df.loc[1:2, "원산지"]='과테말라'
df.head(4)

      메뉴    가격  칼로리   원산지
4    밀크티  5500  300   NaN
1   카페라뗴  5000  110  과테말라
2   카페모카  5000  250  과테말라
0  아메리카노  4000   20  콜롬비아

In [75]:
df.loc['시즌']=['크리스마스라떼',600,300,'한국']
df.tail(3)

         메뉴    가격  칼로리   원산지
0     아메리카노  4000   20  콜롬비아
3     에스프레소  3000   20  과테말라
시즌  크리스마스라떼   600  300    한국

In [76]:
df.loc[7]={'메뉴':'딴짓커피','가격':2000,'칼로리':20}
df.tail(3)

         메뉴    가격  칼로리   원산지
3     에스프레소  3000   20  과테말라
시즌  크리스마스라떼   600  300    한국
7      딴짓커피  2000   20   NaN

In [78]:
df = df.drop("시즌",axis=0)
df.to_csv('cafe2.csv',index=False)

KeyError: "['시즌'] not found in axis"

In [97]:
df=pd.read_csv('cafe2.csv')
df.head(2)

     메뉴    가격  칼로리   원산지
0   밀크티  5500  300   NaN
1  카페라뗴  5000  110  과테말라

In [98]:
df.sort_values('메뉴',ascending=False)

      메뉴    가격  칼로리   원산지
2   카페모카  5000  250  과테말라
1   카페라뗴  5000  110  과테말라
4  에스프레소  3000   20  과테말라
3  아메리카노  4000   20  콜롬비아
0    밀크티  5500  300   NaN
5   딴짓커피  2000   20   NaN

In [99]:
#가격과 메뉴 기준 정렬
df=df.sort_values(['가격','메뉴'], ascending=[False, True])
df

      메뉴    가격  칼로리   원산지
0    밀크티  5500  300   NaN
1   카페라뗴  5000  110  과테말라
2   카페모카  5000  250  과테말라
3  아메리카노  4000   20  콜롬비아
4  에스프레소  3000   20  과테말라
5   딴짓커피  2000   20   NaN

In [100]:
#인덱스 새로 만들기 drop=True
df.reset_index(drop=True)

      메뉴    가격  칼로리   원산지
0    밀크티  5500  300   NaN
1   카페라뗴  5000  110  과테말라
2   카페모카  5000  250  과테말라
3  아메리카노  4000   20  콜롬비아
4  에스프레소  3000   20  과테말라
5   딴짓커피  2000   20   NaN

In [112]:
df = pd.read_csv('cafe2.csv')
df.head(2)

     메뉴    가격  칼로리   원산지
0   밀크티  5500  300   NaN
1  카페라뗴  5000  110  과테말라

In [113]:
df['칼로리']<50

0    False
1    False
2    False
3     True
4     True
5     True
Name: 칼로리, dtype: bool

In [114]:
#1개 조건
cond=df['칼로리']<50
df[cond]

      메뉴    가격  칼로리   원산지
3  아메리카노  4000   20  콜롬비아
4  에스프레소  3000   20  과테말라
5   딴짓커피  2000   20   NaN

In [115]:
#1개 조건
df[df['칼로리']<50]

      메뉴    가격  칼로리   원산지
3  아메리카노  4000   20  콜롬비아
4  에스프레소  3000   20  과테말라
5   딴짓커피  2000   20   NaN

In [116]:
#2개 이상일 때(and)
cond1 = df['가격'] >= 5000
cond2 = df['칼로리'] > 100
df[cond1 & cond2]

     메뉴    가격  칼로리   원산지
0   밀크티  5500  300   NaN
1  카페라뗴  5000  110  과테말라
2  카페모카  5000  250  과테말라

In [117]:
#2개 이상일 때(or)
df[cond1 | cond2]

     메뉴    가격  칼로리   원산지
0   밀크티  5500  300   NaN
1  카페라뗴  5000  110  과테말라
2  카페모카  5000  250  과테말라

In [118]:
df['메뉴'].isin(['밀크티'])

0     True
1    False
2    False
3    False
4    False
5    False
Name: 메뉴, dtype: bool

In [119]:
cond = df['메뉴'].isin(['밀크티'])
df[cond]

    메뉴    가격  칼로리  원산지
0  밀크티  5500  300  NaN

In [120]:
box=['아메리카노','카페라뗴','밀크티']
cond=df['메뉴'].isin(box)
df[cond]

      메뉴    가격  칼로리   원산지
0    밀크티  5500  300   NaN
1   카페라뗴  5000  110  과테말라
3  아메리카노  4000   20  콜롬비아

In [123]:
df = pd.read_csv('cafe2.csv')
df.head(2)

     메뉴    가격  칼로리   원산지
0   밀크티  5500  300   NaN
1  카페라뗴  5000  110  과테말라

In [125]:
df

      메뉴    가격  칼로리   원산지
0    밀크티  5500  300   NaN
1   카페라뗴  5000  110  과테말라
2   카페모카  5000  250  과테말라
3  아메리카노  4000   20  콜롬비아
4  에스프레소  3000   20  과테말라
5   딴짓커피  2000   20   NaN

In [126]:
df['원산지']=df['원산지'].fillna('코스타리카')
df

      메뉴    가격  칼로리    원산지
0    밀크티  5500  300  코스타리카
1   카페라뗴  5000  110   과테말라
2   카페모카  5000  250   과테말라
3  아메리카노  4000   20   콜롬비아
4  에스프레소  3000   20   과테말라
5   딴짓커피  2000   20  코스타리카

In [127]:
df.to_csv("cafe3.csv",index=False)

In [128]:
pd.read_csv("cafe3.csv")
df.head(3)

     메뉴    가격  칼로리    원산지
0   밀크티  5500  300  코스타리카
1  카페라뗴  5000  110   과테말라
2  카페모카  5000  250   과테말라

In [130]:
#문자 변경
df=df.replace('카페라뗴','자허블')
df=df.replace('밀크티','그린티')
df

      메뉴    가격  칼로리    원산지
0    그린티  5500  300  코스타리카
1    자허블  5000  110   과테말라
2   카페모카  5000  250   과테말라
3  아메리카노  4000   20   콜롬비아
4  에스프레소  3000   20   과테말라
5   딴짓커피  2000   20  코스타리카

In [132]:
change = {'자허블':'카페라떼','그린티':'밀크티'}
df=df.replace(change) #딕셔너리로 먼저 매핑 사전 만들어놓고 나중에 변경 가능
df

      메뉴    가격  칼로리    원산지
0    밀크티  5500  300  코스타리카
1   카페라떼  5000  110   과테말라
2   카페모카  5000  250   과테말라
3  아메리카노  4000   20   콜롬비아
4  에스프레소  3000   20   과테말라
5   딴짓커피  2000   20  코스타리카

In [133]:
df.loc[4,'원산지']='대한민국'
df.tail(3)

      메뉴    가격  칼로리    원산지
3  아메리카노  4000   20   콜롬비아
4  에스프레소  3000   20   대한민국
5   딴짓커피  2000   20  코스타리카

In [134]:
df.loc[1:2,'이벤트가']=1000
df.head()

      메뉴    가격  칼로리    원산지    이벤트가
0    밀크티  5500  300  코스타리카     NaN
1   카페라떼  5000  110   과테말라  1000.0
2   카페모카  5000  250   과테말라  1000.0
3  아메리카노  4000   20   콜롬비아     NaN
4  에스프레소  3000   20   대한민국     NaN

In [135]:
df.to_csv("cafe4.csv",index=False)

In [1]:
import pandas as pd
df = pd.DataFrame({
    'A':['데이터 분석','기본 학습서','화이팅'],
    'B':[10,20,30],
    'C':['ab cd', 'AB CD', 'ab cd ']
})
df

        A   B       C
0  데이터 분석  10   ab cd
1  기본 학습서  20   AB CD
2     화이팅  30  ab cd

In [3]:
df['A']=df['A'].replace('분석','시각화')
df

        A   B       C
0  데이터 분석  10   ab cd
1  기본 학습서  20   AB CD
2     화이팅  30  ab cd

In [5]:
#문자열에서 일부만 바꾸고자 할 경우
df['A']=df['A'].str.replace('분석','시각화')
df

         A   B       C
0  데이터 시각화  10   ab cd
1   기본 학습서  20   AB CD
2      화이팅  30  ab cd

In [7]:
df['B']=df['B'].replace(10,100)
df

         A    B       C
0  데이터 시각화  100   ab cd
1   기본 학습서   20   AB CD
2      화이팅   30  ab cd

In [9]:
df['A'].str.split()

0    [데이터, 시각화]
1     [기본, 학습서]
2         [화이팅]
Name: A, dtype: object

In [11]:
df['A'].str.split()[0]

['데이터', '시각화']

In [15]:
df['D']=df['A'].str.split().str[-1]
df

         A    B       C    D
0  데이터 시각화  100   ab cd  시각화
1   기본 학습서   20   AB CD  학습서
2      화이팅   30  ab cd   화이팅

In [17]:
#문자 검색
df['A'].str.contains('기본')

0    False
1     True
2    False
Name: A, dtype: bool

In [19]:
df['기본포함유무']=df['A'].str.contains('기본')
df

         A    B       C    D  기본포함유무
0  데이터 시각화  100   ab cd  시각화   False
1   기본 학습서   20   AB CD  학습서    True
2      화이팅   30  ab cd   화이팅   False

In [21]:
#단어가 다 똑같아야지만 찾을 수 있음
menu = pd.Series(['맛난버거 세트','매운 치즈버거','더블 치즈버거'])
menu.isin(['맛난버거 세트','더블 치즈버거'])

0     True
1    False
2     True
dtype: bool

In [23]:
#문자 일부만 있어도 되지만 여러개 못찾음. 한 번에 하나씩만 찾을 수 있음
menu.str.contains('세트')

0     True
1    False
2    False
dtype: bool

In [25]:
df['문자길이']=df['A'].str.len()
df

         A    B       C    D  기본포함유무  문자길이
0  데이터 시각화  100   ab cd  시각화   False     7
1   기본 학습서   20   AB CD  학습서    True     6
2      화이팅   30  ab cd   화이팅   False     3

In [27]:
'AB cd'=='ab CD'

False

In [29]:
df['C']=df['C'].str.lower()
df['C']

0     ab cd
1     ab cd
2    ab cd
Name: C, dtype: object

In [31]:
df['C']=df['C'].str.upper()
df['C']

0     AB CD
1     AB CD
2    AB CD
Name: C, dtype: object

In [33]:
df['C']=='AB CD' #띄어쓰기 때문에

0     True
1     True
2    False
Name: C, dtype: bool

In [35]:
df['C']=df['C'].str.lower()
df['C']=df['C'].str.replace(" ","")
df['C']

0    abcd
1    abcd
2    abcd
Name: C, dtype: object

In [37]:
df['C'].str[1:3]

0    bc
1    bc
2    bc
Name: C, dtype: object

In [39]:
df=pd.read_csv("cafe4.csv")
df.head(2)

     메뉴    가격  칼로리    원산지    이벤트가
0   밀크티  5500  300  코스타리카     NaN
1  카페라떼  5000  110   과테말라  1000.0

In [41]:
#행의 수
print(len(df))
print(df.shape[0])

6
6

In [45]:
df['가격']>4000

0     True
1     True
2     True
3    False
4    False
5    False
Name: 가격, dtype: bool

In [49]:
cond=df['가격']>4000

print(sum(cond))

print(len(df[cond]))

3
3

In [51]:
df.sum(numeric_only=True)

가격      24500.0
칼로리       720.0
이벤트가     2000.0
dtype: float64

In [53]:
df.sum(axis=1,numeric_only=True)

0    5800.0
1    6110.0
2    6250.0
3    4020.0
4    3020.0
5    2020.0
dtype: float64

In [ ]:
#참고
#drop() : axis=0 -> 행 삭제 / axis = 1 -> 컬럼 삭제
#sum() : axis=0 -> 컬럼별 합계 / axis = 1 -> 행별 합

In [55]:
print("최대값: ",df['가격'].max())
print("최소값: ",df['가격'].min())
print("평균값: ",df['가격'].mean())
print("중앙값: ",df['가격'].median())
print("합계: ",df['가격'].sum())
print("표준편차: ",df['가격'].std())
print("분산: ",df['가격'].var())

최대값:  5500
최소값:  2000
평균값:  4083.3333333333335
중앙값:  4500.0
합계:  24500
표준편차:  1357.0801990548186
분산:  1841666.6666666665

In [57]:
#분위수
print("분위수 25% 값",df['가격'].quantile(.25))
print("분위수 75% 값",df['가격'].quantile(.75))

분위수 25% 값 3250.0
분위수 75% 값 5000.0

In [59]:
#하위 25% 데이터
cond=df['가격'].quantile(.25)>df['가격']
df[cond]

      메뉴    가격  칼로리    원산지  이벤트가
4  에스프레소  3000   20   대한민국   NaN
5   딴짓커피  2000   20  코스타리카   NaN

In [61]:
#상위 25% 데이터
cond=df['가격'].quantile(.75)<df['가격']
df[cond]

    메뉴    가격  칼로리    원산지  이벤트가
0  밀크티  5500  300  코스타리카   NaN

In [63]:
#최빈값 구하기
df['원산지'].mode()[0]

'과테말라'

In [65]:
df['가격'].idxmax() #가장 큰 값의 인덱스 출력

0

In [67]:
max_ind=df['가격'].idxmax()
df.loc[max_ind]

메뉴        밀크티
가격       5500
칼로리       300
원산지     코스타리카
이벤트가      NaN
Name: 0, dtype: object

In [69]:
df.loc[max_ind,'메뉴']

'밀크티'

In [71]:
df.nlargest(3,'가격')

     메뉴    가격  칼로리    원산지    이벤트가
0   밀크티  5500  300  코스타리카     NaN
1  카페라떼  5000  110   과테말라  1000.0
2  카페모카  5000  250   과테말라  1000.0

In [73]:
df.nsmallest(2,'가격')

      메뉴    가격  칼로리    원산지  이벤트가
5   딴짓커피  2000   20  코스타리카   NaN
4  에스프레소  3000   20   대한민국   NaN

In [75]:
def cal(x):
    if x>=100:
        return "No"
    else:
        return "Yes"

df['먹어도 될까요']=df['칼로리'].apply(cal)
df

      메뉴    가격  칼로리    원산지    이벤트가 먹어도 될까요
0    밀크티  5500  300  코스타리카     NaN      No
1   카페라떼  5000  110   과테말라  1000.0      No
2   카페모카  5000  250   과테말라  1000.0      No
3  아메리카노  4000   20   콜롬비아     NaN     Yes
4  에스프레소  3000   20   대한민국     NaN     Yes
5   딴짓커피  2000   20  코스타리카     NaN     Yes

In [77]:
import pandas as pd
df=pd.DataFrame({
    'Name':{0: '쿼카', 1: '알파카', 2: '시바견'},
    '수학': {0: 90, 1: 93, 2: 85},
    '영어': {0: 92, 1: 93, 2: 86},
    '국어': {0: 91, 1: 94, 2: 83},
})
df

  Name  수학  영어  국어
0   쿼카  90  92  91
1  알파카  93  93  94
2  시바견  85  86  83

In [79]:
pd.melt(df, id_vars=['Name'])

  Name variable  value
0   쿼카       수학     90
1  알파카       수학     93
2  시바견       수학     85
3   쿼카       영어     92
4  알파카       영어     93
5  시바견       영어     86
6   쿼카       국어     91
7  알파카       국어     94
8  시바견       국어     83

In [81]:
pd.melt(df, id_vars=['Name'], value_vars=['수학','영어'])

  Name variable  value
0   쿼카       수학     90
1  알파카       수학     93
2  시바견       수학     85
3   쿼카       영어     92
4  알파카       영어     93
5  시바견       영어     86

In [83]:
pd.melt(df, id_vars=['Name'], var_name='과목', value_name='점수')

  Name  과목  점수
0   쿼카  수학  90
1  알파카  수학  93
2  시바견  수학  85
3   쿼카  영어  92
4  알파카  영어  93
5  시바견  영어  86
6   쿼카  국어  91
7  알파카  국어  94
8  시바견  국어  83

In [85]:
import pandas as pd

df=pd.DataFrame({
    "반": ["A반","A반","B반"],
    "이름": ["쿼카","알파카","시바견"],
    "수학": [90,93,85],
    "영어": [92,84,86],
    "국어": [91,94,83]
})
df

    반   이름  수학  영어  국어
0  A반   쿼카  90  92  91
1  A반  알파카  93  84  94
2  B반  시바견  85  86  83

In [89]:
pd.melt(df, id_vars=["반","이름"],var_name="과목", value_name="점수")

    반   이름  과목  점수
0  A반   쿼카  수학  90
1  A반  알파카  수학  93
2  B반  시바견  수학  85
3  A반   쿼카  영어  92
4  A반  알파카  영어  84
5  B반  시바견  영어  86
6  A반   쿼카  국어  91
7  A반  알파카  국어  94
8  B반  시바견  국어  83

In [91]:
#그룹핑
df=pd.read_csv("cafe4.csv")
df.head(2)

     메뉴    가격  칼로리    원산지    이벤트가
0   밀크티  5500  300  코스타리카     NaN
1  카페라떼  5000  110   과테말라  1000.0

In [93]:
#원산지 기준, 평균
df.groupby(['원산지']).mean(numeric_only=True)

           가격    칼로리    이벤트가
원산지
과테말라   5000.0  180.0  1000.0
대한민국   3000.0   20.0     NaN
코스타리카  3750.0  160.0     NaN
콜롬비아   4000.0   20.0     NaN

In [95]:
df.groupby(['원산지','칼로리']).mean(numeric_only=True)

               가격    이벤트가
원산지   칼로리
과테말라  110  5000.0  1000.0
      250  5000.0  1000.0
대한민국  20   3000.0     NaN
코스타리카 20   2000.0     NaN
      300  5500.0     NaN
콜롬비아  20   4000.0     NaN

In [97]:
#원산지와 메뉴 기준(평균, 합계)
df.groupby(['원산지','메뉴']).agg(['mean','sum'])

                 가격          칼로리         이벤트가
               mean   sum   mean  sum    mean     sum
원산지   메뉴
과테말라  카페라떼   5000.0  5000  110.0  110  1000.0  1000.0
      카페모카   5000.0  5000  250.0  250  1000.0  1000.0
대한민국  에스프레소  3000.0  3000   20.0   20     NaN     0.0
코스타리카 딴짓커피   2000.0  2000   20.0   20     NaN     0.0
      밀크티    5500.0  5500  300.0  300     NaN     0.0
콜롬비아  아메리카노  4000.0  4000   20.0   20     NaN     0.0

In [99]:
#1개 인덱스 형태로 리셋
df.groupby(['원산지','칼로리']).mean(numeric_only=True).reset_index()

     원산지  칼로리      가격    이벤트가
0   과테말라  110  5000.0  1000.0
1   과테말라  250  5000.0  1000.0
2   대한민국   20  3000.0     NaN
3  코스타리카   20  2000.0     NaN
4  코스타리카  300  5500.0     NaN
5   콜롬비아   20  4000.0     NaN

In [101]:
#transform
import pandas as pd

#데이터 생성(일부 결측값 포함)
df=pd.DataFrame({
    '과일':['딸기','블루베리','딸기','블루베리','딸기','블루베리','딸기','블루베리'],
    '가격':[1000,None,1500,None,2000,2500,None,1800]
})
df

     과일      가격
0    딸기  1000.0
1  블루베리     NaN
2    딸기  1500.0
3  블루베리     NaN
4    딸기  2000.0
5  블루베리  2500.0
6    딸기     NaN
7  블루베리  1800.0

In [103]:
price=df.groupby('과일')['가격'].transform("mean")
price

0    1500.0
1    2150.0
2    1500.0
3    2150.0
4    1500.0
5    2150.0
6    1500.0
7    2150.0
Name: 가격, dtype: float64

In [105]:
df.groupby('과일').mean()

          가격
과일
딸기    1500.0
블루베리  2150.0

In [107]:
df['가격']=df['가격'].fillna(price)
df

     과일      가격
0    딸기  1000.0
1  블루베리  2150.0
2    딸기  1500.0
3  블루베리  2150.0
4    딸기  2000.0
5  블루베리  2500.0
6    딸기  1500.0
7  블루베리  1800.0

In [109]:
df=pd.DataFrame({
    '과일':['딸기','블루베리','딸기','블루베리','딸기','블루베리','딸기','블루베리'],
    '등급':['B','B','A','A','A','A','B','B'],
    '가격':[1000,None,1500,None,2000,2500,None,1800]
})
df

     과일 등급      가격
0    딸기  B  1000.0
1  블루베리  B     NaN
2    딸기  A  1500.0
3  블루베리  A     NaN
4    딸기  A  2000.0
5  블루베리  A  2500.0
6    딸기  B     NaN
7  블루베리  B  1800.0

In [115]:
price=df.groupby(['과일','등급'])['가격'].transform("mean")
price

0    1000.0
1    1800.0
2    1750.0
3    2500.0
4    1750.0
5    2500.0
6    1000.0
7    1800.0
Name: 가격, dtype: float64

In [117]:
df['가격']=df['가격'].fillna(price)
df

     과일 등급      가격
0    딸기  B  1000.0
1  블루베리  B  1800.0
2    딸기  A  1500.0
3  블루베리  A  2500.0
4    딸기  A  2000.0
5  블루베리  A  2500.0
6    딸기  B  1000.0
7  블루베리  B  1800.0

In [119]:
#unstack
import pandas as pd

coffee_data={
    '커피종류':['아메리카노','아메리카노','아메리카노','라떼','라떼','라떼'],
    '컵크기':['Small','Medium','Large','Small','Medium','Large'],
    '판매량':[120,150,200,100,130,180]
}
df=pd.DataFrame(coffee_data)
df

    커피종류     컵크기  판매량
0  아메리카노   Small  120
1  아메리카노  Medium  150
2  아메리카노   Large  200
3     라떼   Small  100
4     라떼  Medium  130
5     라떼   Large  180

In [123]:
grouped = df.groupby(['커피종류','컵크기'])['판매량'].sum()
grouped

커피종류   컵크기
라떼     Large     180
       Medium    130
       Small     100
아메리카노  Large     200
       Medium    150
       Small     120
Name: 판매량, dtype: int64

In [125]:
#컵크기를 컬럼으로 변환
grouped.unstack()

컵크기    Large  Medium  Small
커피종류
라떼       180     130    100
아메리카노    200     150    120

In [127]:
#커피종류를 컬럼으로 변환
grouped.unstack(level=0)

커피종류     라떼  아메리카노
컵크기
Large   180    200
Medium  130    150
Small   100    120

In [129]:
grouped.unstack().unstack()

컵크기     커피종류
Large   라떼       180
        아메리카노    200
Medium  라떼       130
        아메리카노    150
Small   라떼       100
        아메리카노    120
dtype: int64

In [131]:
import pandas as pd

#에피타이저 메뉴
appetizer=pd.DataFrame({
    'Menu':['Salad','Soup','Bread'],
    'Price':[5000,3000,2000]
})

#메인 메뉴
main=pd.DataFrame({
    'Menu':['Steak','Pasta','Chicken'],
    'Price':[15000,12000,10000]
})
print(appetizer)
print(main)

    Menu  Price
0  Salad   5000
1   Soup   3000
2  Bread   2000
      Menu  Price
0    Steak  15000
1    Pasta  12000
2  Chicken  10000

In [133]:
#두 메뉴를 수직으로 연결
full_menu=pd.concat([appetizer, main], ignore_index=True)
full_menu

      Menu  Price
0    Salad   5000
1     Soup   3000
2    Bread   2000
3    Steak  15000
4    Pasta  12000
5  Chicken  10000

In [135]:
#두 메뉴를 좌우로 연결
full_menu=pd.concat([appetizer, main], axis=1)
full_menu

    Menu  Price     Menu  Price
0  Salad   5000    Steak  15000
1   Soup   3000    Pasta  12000
2  Bread   2000  Chicken  10000

In [137]:
price=pd.DataFrame({
    'Menu':['Salad','Soup','Steak','Pasta'],
    'Price':[5000,3000,15000,12000]
})

cal=pd.DataFrame({
    'Menu':['Soup','Steak','Pasta','Salad'],
    'Calories':[100,500,400,150]
})

#두 데이터프레임을 'Menu'를 기준으로 병합
menu_info=pd.merge(price,cal,on='Menu')
menu_info

    Menu  Price  Calories
0  Salad   5000       150
1   Soup   3000       100
2  Steak  15000       500
3  Pasta  12000       400

In [139]:
#피벗테이블
import pandas as pd

data={
    '이름':['서아','다인','채아','예담','종현','태헌'],
    '부서':['개발','기획','개발','기획','개발','기획'],
    '급여':[3000,3200,3100,3300,2900,3100]
}
df=pd.DataFrame(data)
print("[원본 데이터]")
print(df)

pt=df.pivot_table(index='부서',values='급여',aggfunc='mean')
print("\n[부서별 평균 급여]")
print(pt)

[원본 데이터]
   이름  부서    급여
0  서아  개발  3000
1  다인  기획  3200
2  채아  개발  3100
3  예담  기획  3300
4  종현  개발  2900
5  태헌  기획  3100

[부서별 평균 급여]
        급여
부서
개발  3000.0
기획  3200.0

In [141]:
data={
    '부서':['개발','기획','개발','개발','기획','기획'],
    '직급':['대리','과장','대리','과장','대리','과장'],
    '급여':[3000,4000,3200,4200,3500,4500]
}
df=pd.DataFrame(data)
print("[원본 데이터]")
print(df)

#부서 및 직급별 급여 합계 계산
pt=df.pivot_table(index='부서',columns='직급',values='급여',aggfunc='sum')
print("\n[부서 및 직급별 급여 합계]")
print(pt)

[원본 데이터]
   부서  직급    급여
0  개발  대리  3000
1  기획  과장  4000
2  개발  대리  3200
3  개발  과장  4200
4  기획  대리  3500
5  기획  과장  4500

[부서 및 직급별 급여 합계]
직급    과장    대리
부서
개발  4200  6200
기획  8500  3500

In [145]:
#부서와 성별, 근속연수 정보
data={
    '부서':['개발','기획','기획','기획','개발','개발'],
    '성별':['남','여','남','여','남','여'],
    '근속연수':[3,5,4,6,7,8]
}
df=pd.DataFrame(data)
print("[원본 데이터]")
print(df)

#부서 및 성별 평균 근속연수 계산
pt=df.pivot_table(index='부서',columns='성별',values='근속연수',aggfunc='mean')
print("\n[부서 및 성별 평균 근속연수]")
print(pt)

[원본 데이터]
   부서 성별  근속연수
0  개발  남     3
1  기획  여     5
2  기획  남     4
3  기획  여     6
4  개발  남     7
5  개발  여     8

[부서 및 성별 평균 근속연수]
성별    남    여
부서
개발  5.0  8.0
기획  4.0  5.5

In [147]:
#다양한 집계를 위한 데이터셋
import pandas as pd

df=pd.DataFrame({
    "구분":["전자","전자","전자","전자","전자","가전","가전","가전","가전"],
    "유형":["일반","일반","일반","특수","특수","일반","일반","특수","특수"],
    "크기":["소형","대형","대형","소형","소형","대형","소형","소형","대형"],
    "수량":[1,2,2,3,3,4,5,6,7],
    "금액":[2,4,5,5,6,6,8,9,9]
})
print(df)

   구분  유형  크기  수량  금액
0  전자  일반  소형   1   2
1  전자  일반  대형   2   4
2  전자  일반  대형   2   5
3  전자  특수  소형   3   5
4  전자  특수  소형   3   6
5  가전  일반  대형   4   6
6  가전  일반  소형   5   8
7  가전  특수  소형   6   9
8  가전  특수  대형   7   9

In [149]:
#단일 값에 대해 집계
pt=df.pivot_table(
    index=['구분','유형'],
    columns='크기',
    values='수량',
    aggfunc='sum'
)
pt

크기      대형   소형
구분 유형
가전 일반  4.0  5.0
   특수  7.0  6.0
전자 일반  4.0  1.0
   특수  NaN  6.0

In [151]:
#단일 값에 대해 집계(누락값 0처리)
pt=df.pivot_table(
    index=['구분','유형'],
    columns='크기',
    values='수량',
    aggfunc='sum',
    fill_value=0
)
pt

크기     대형  소형
구분 유형
가전 일반   4   5
   특수   7   6
전자 일반   4   1
   특수   0   6

In [153]:
#여러 열에 대해 각기 다른 집계 함수 적용
pt=df.pivot_table(
    index=['구분','크기'],
    values=['수량','금액'],
    aggfunc={'수량':"mean", '금액':"mean"}
)
pt

             금액        수량
구분 크기
가전 대형  7.500000  5.500000
   소형  8.500000  5.500000
전자 대형  4.500000  2.000000
   소형  4.333333  2.333333

In [155]:
pt=df.pivot_table(
    index=['구분','크기'],
    values=['수량','금액'],
    aggfunc={'수량':"mean", '금액':["min","max","mean"]}
)
pt

       금액                      수량
      max      mean min      mean
구분 크기
가전 대형   9  7.500000   6  5.500000
   소형   9  8.500000   8  5.500000
전자 대형   5  4.500000   4  2.000000
   소형   6  4.333333   2  2.333333

In [157]:
pt.reset_index()

   구분  크기  금액                      수량
          max      mean min      mean
0  가전  대형   9  7.500000   6  5.500000
1  가전  소형   9  8.500000   8  5.500000
2  전자  대형   5  4.500000   4  2.000000
3  전자  소형   6  4.333333   2  2.333333

In [159]:
#시계열데터터
import pandas as pd
data={
    'Date1': ['2024-02-17', '2024-02-18', '2024-02-19'],
    'Date2': ['2024:02:17', '2024:02:18', '2024:02:19'],
    'Date3': ['24/02/17', '24/02/18', '24/02/19'],
    'Date4': ['02/17/2024', '02/18/2024', '02/19/2024'],
    'Date5': ['17-Feb-2024', '18-Feb-2024', '19-Feb-2024'],
    'Date6': ['2024년02월17일', '2024년02월18일', '2024년02월19일'],
    'DateTime1': ['24-02-17 11:45:30', '24-02-18 12:55:45', '24-02-19 13:30:15'],
    'DateTime2': ['2024-02-17 11-45-30', '2024-02-18 12-55-45', '2024-02-19 13-30-15'],
    'DateTime3': ['02/17/2024 11:45:30 AM', '02/18/2024 12:55:45 PM', '02/19/2024 01:30:15 PM'],
    'DateTime4': ['17 Feb 2024 11:45:30', '18 Feb 2024 12:55:45', '19 Feb 2024 13:30:15']
}

df=pd.DataFrame(data)
df.to_csv("date.csv", index=False)
df

,Date1,Date2,Date3,Date4,Date5,Date6,DateTime1,DateTime2,DateTime3,DateTime4
0,2024-02-17,2024:02:17,24/02/17,02/17/2024,17-Feb-2024,2024년02월17일,24-02-17 11:45:30,2024-02-17 11-45-30,02/17/2024 11:45:30 AM,17 Feb 2024 11:45:30
1,2024-02-18,2024:02:18,24/02/18,02/18/2024,18-Feb-2024,2024년02월18일,24-02-18 12:55:45,2024-02-18 12-55-45,02/18/2024 12:55:45 PM,18 Feb 2024 12:55:45
2,2024-02-19,2024:02:19,24/02/19,02/19/2024,19-Feb-2024,2024년02월19일,24-02-19 13:30:15,2024-02-19 13-30-15,02/19/2024 01:30:15 PM,19 Feb 2024 13:30:15

In [161]:
pd.to_datetime(df['Date1'])

0   2024-02-17
1   2024-02-18
2   2024-02-19
Name: Date1, dtype: datetime64[ns]

In [163]:
# Date1
df = pd.read_csv("date.csv")
print(df['Date1'])
df['Date1'] = pd.to_datetime(df['Date1'])
print(df['Date1'])

0    2024-02-17
1    2024-02-18
2    2024-02-19
Name: Date1, dtype: object
0   2024-02-17
1   2024-02-18
2   2024-02-19
Name: Date1, dtype: datetime64[ns]

In [171]:
df = pd.read_csv("date.csv")
print(df['Date2'])
df['Date2'] = pd.to_datetime(df['Date2'],format="%Y:%m:%d")
print(df['Date2'])

0    2024:02:17
1    2024:02:18
2    2024:02:19
Name: Date2, dtype: object
0   2024-02-17
1   2024-02-18
2   2024-02-19
Name: Date2, dtype: datetime64[ns]

In [173]:
df = pd.read_csv("date.csv")
print(df['Date3'])
df['Date3'] = pd.to_datetime(df['Date3'], format="%y/%m/%d")
print(df['Date3'])

0    24/02/17
1    24/02/18
2    24/02/19
Name: Date3, dtype: object
0   2024-02-17
1   2024-02-18
2   2024-02-19
Name: Date3, dtype: datetime64[ns]

In [175]:
df = pd.read_csv("date.csv")
print(df['Date4'])
df['Date4'] = pd.to_datetime(df['Date4'])
print(df['Date4'])

0    02/17/2024
1    02/18/2024
2    02/19/2024
Name: Date4, dtype: object
0   2024-02-17
1   2024-02-18
2   2024-02-19
Name: Date4, dtype: datetime64[ns]

In [177]:
df = pd.read_csv("date.csv")
print(df['Date5'])
df['Date5'] = pd.to_datetime(df['Date5'])
print(df['Date5'])

0    17-Feb-2024
1    18-Feb-2024
2    19-Feb-2024
Name: Date5, dtype: object
0   2024-02-17
1   2024-02-18
2   2024-02-19
Name: Date5, dtype: datetime64[ns]

In [181]:
df = pd.read_csv("date.csv")
print(df['Date6'])
df['Date6'] = pd.to_datetime(df['Date6'], format="%Y년%m월%d일")
print(df['Date6'])

0    2024년02월17일
1    2024년02월18일
2    2024년02월19일
Name: Date6, dtype: object
0   2024-02-17
1   2024-02-18
2   2024-02-19
Name: Date6, dtype: datetime64[ns]

In [187]:
df = pd.read_csv("date.csv")
print(df['DateTime1'])
df['DateTime1'] = pd.to_datetime(df['DateTime1'],format="%y-%m-%d %H:%M:%S")
print(df['DateTime1'])

0    24-02-17 11:45:30
1    24-02-18 12:55:45
2    24-02-19 13:30:15
Name: DateTime1, dtype: object
0   2024-02-17 11:45:30
1   2024-02-18 12:55:45
2   2024-02-19 13:30:15
Name: DateTime1, dtype: datetime64[ns]

In [191]:
df = pd.read_csv("date.csv")
print(df['DateTime2'])
df['DateTime2'] = pd.to_datetime(df['DateTime2'],format="%Y-%m-%d %H-%M-%S")
print(df['DateTime2'])

0    2024-02-17 11-45-30
1    2024-02-18 12-55-45
2    2024-02-19 13-30-15
Name: DateTime2, dtype: object
0   2024-02-17 11:45:30
1   2024-02-18 12:55:45
2   2024-02-19 13:30:15
Name: DateTime2, dtype: datetime64[ns]

In [193]:
df = pd.read_csv("date.csv")
print(df['DateTime3'])
df['DateTime3'] = pd.to_datetime(df['DateTime3'])
print(df['DateTime3'])

0    02/17/2024 11:45:30 AM
1    02/18/2024 12:55:45 PM
2    02/19/2024 01:30:15 PM
Name: DateTime3, dtype: object
0   2024-02-17 11:45:30
1   2024-02-18 12:55:45
2   2024-02-19 13:30:15
Name: DateTime3, dtype: datetime64[ns]

In [195]:
df = pd.read_csv("date.csv")
print(df['DateTime4'])
df['DateTime4'] = pd.to_datetime(df['DateTime4'])
print(df['DateTime4'])

0    17 Feb 2024 11:45:30
1    18 Feb 2024 12:55:45
2    19 Feb 2024 13:30:15
Name: DateTime4, dtype: object
0   2024-02-17 11:45:30
1   2024-02-18 12:55:45
2   2024-02-19 13:30:15
Name: DateTime4, dtype: datetime64[ns]

In [197]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date1      3 non-null      object
 1   Date2      3 non-null      object
 2   Date3      3 non-null      object
 3   Date4      3 non-null      object
 4   Date5      3 non-null      object
 5   Date6      3 non-null      object
 6   DateTime1  3 non-null      object
 7   DateTime2  3 non-null      object
 8   DateTime3  3 non-null      object
 9   DateTime4  3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(9)
memory usage: 372.0+ bytes

In [201]:
df['year']=df['DateTime4'].dt.year
df['month']=df['DateTime4'].dt.month
df['day']=df['DateTime4'].dt.day
df['hour']=df['DateTime4'].dt.hour
df['minute']=df['DateTime4'].dt.minute
df['second']=df['DateTime4'].dt.second
df

,Date1,Date2,Date3,Date4,Date5,Date6,DateTime1,DateTime2,DateTime3,DateTime4,year,month,day,hour,minute,second
0,2024-02-17,2024:02:17,24/02/17,02/17/2024,17-Feb-2024,2024년02월17일,24-02-17 11:45:30,2024-02-17 11-45-30,02/17/2024 11:45:30 AM,2024-02-17 11:45:30,2024,2,17,11,45,30
1,2024-02-18,2024:02:18,24/02/18,02/18/2024,18-Feb-2024,2024년02월18일,24-02-18 12:55:45,2024-02-18 12-55-45,02/18/2024 12:55:45 PM,2024-02-18 12:55:45,2024,2,18,12,55,45
2,2024-02-19,2024:02:19,24/02/19,02/19/2024,19-Feb-2024,2024년02월19일,24-02-19 13:30:15,2024-02-19 13-30-15,02/19/2024 01:30:15 PM,2024-02-19 13:30:15,2024,2,19,13,30,15

In [203]:
#요일 dayofweek 0:월 1:화 2:수 3:목 4:금 5:토 6:일
df['DateTime4'].dt.dayofweek

0    5
1    6
2    0
Name: DateTime4, dtype: int32

In [207]:
#주말
df['is주말']=df['DateTime4'].dt.dayofweek>=5
df

,Date1,Date2,Date3,Date4,Date5,Date6,DateTime1,DateTime2,DateTime3,DateTime4,year,month,day,hour,minute,second,is주말
0,2024-02-17,2024:02:17,24/02/17,02/17/2024,17-Feb-2024,2024년02월17일,24-02-17 11:45:30,2024-02-17 11-45-30,02/17/2024 11:45:30 AM,2024-02-17 11:45:30,2024,2,17,11,45,30,True
1,2024-02-18,2024:02:18,24/02/18,02/18/2024,18-Feb-2024,2024년02월18일,24-02-18 12:55:45,2024-02-18 12-55-45,02/18/2024 12:55:45 PM,2024-02-18 12:55:45,2024,2,18,12,55,45,True
2,2024-02-19,2024:02:19,24/02/19,02/19/2024,19-Feb-2024,2024년02월19일,24-02-19 13:30:15,2024-02-19 13-30-15,02/19/2024 01:30:15 PM,2024-02-19 13:30:15,2024,2,19,13,30,15,False

In [231]:
df=pd.read_csv("date.csv",usecols=['DateTime4'], parse_dates=['DateTime4'])
df

            DateTime4
0 2024-02-17 11:45:30
1 2024-02-18 12:55:45
2 2024-02-19 13:30:15

In [233]:
day=pd.Timedelta(days=99)
df['100일']=df['DateTime4']+day
df

            DateTime4                100일
0 2024-02-17 11:45:30 2024-05-26 11:45:30
1 2024-02-18 12:55:45 2024-05-27 12:55:45
2 2024-02-19 13:30:15 2024-05-28 13:30:15

In [235]:
hour=pd.Timedelta(hours=100)
df['100시간']=df['DateTime4']+hour
df

            DateTime4                100일               100시간
0 2024-02-17 11:45:30 2024-05-26 11:45:30 2024-02-21 15:45:30
1 2024-02-18 12:55:45 2024-05-27 12:55:45 2024-02-22 16:55:45
2 2024-02-19 13:30:15 2024-05-28 13:30:15 2024-02-23 17:30:15

In [237]:
diff=pd.Timedelta(weeks=3,days=3,hours=3,minutes=3,seconds=3)
df['+diff']=df['DateTime4']+diff
df['-diff']=df['DateTime4']-diff
df

,DateTime4,100일,100시간,+diff,-diff
0,2024-02-17 11:45:30,2024-05-26 11:45:30,2024-02-21 15:45:30,2024-03-12 14:48:33,2024-01-24 08:42:27
1,2024-02-18 12:55:45,2024-05-27 12:55:45,2024-02-22 16:55:45,2024-03-13 15:58:48,2024-01-25 09:52:42
2,2024-02-19 13:30:15,2024-05-28 13:30:15,2024-02-23 17:30:15,2024-03-14 16:33:18,2024-01-26 10:27:12

In [239]:
diff=df['100일']-df['100시간']
diff

0   94 days 20:00:00
1   94 days 20:00:00
2   94 days 20:00:00
dtype: timedelta64[ns]

In [251]:
print(diff.dt.total_seconds())
print(diff.dt.total_seconds()/60)
print(diff.dt.total_seconds()/60/60)
print(diff.dt.total_seconds()/60/60/24)

0    8193600.0
1    8193600.0
2    8193600.0
dtype: float64
0    136560.0
1    136560.0
2    136560.0
dtype: float64
0    2276.0
1    2276.0
2    2276.0
dtype: float64
0    94.833333
1    94.833333
2    94.833333
dtype: float64

In [253]:
#반올림(ex:5.49분) 30초 이상이면 올림, 미만이면 버림
value=5.49
round(value)

5